//=============================================================================
//
// バトルシステム処理 [battlesystem.h]
// Author : 目黒 未来也
//
//=============================================================================
#ifndef _BATTLESYSTEM_H_
#define _BATTLESYSTEM_H_

#include "main.h"

//========================================
// マクロ定義
//========================================

//========================================
// クラスの定義
//========================================
//=====================
// バトルシステムクラス
//=====================
class CBattleSys
{
public:
	CBattleSys();	// コンストラクタ
	~CBattleSys();	// デストラクタ

	HRESULT Init();		// バトルシステム初期化処理
	void Uninit(void);	// バトルシステム終了処理
	void Update(void);	// バトルシステム更新処理

	static CBattleSys *Create();	// オブジェクトの生成

private:
	int		m_nCntFlame;			//攻撃のフレーム数
	int		m_nImpossibleFlame;		//操作不可時間
	bool	m_bAttack;				//攻撃しているかどうか
};
#endif