//=============================================================================
//
// プレイヤー処理 [dohyo.cpp]
// Author : 長山拓実
//
//=============================================================================
#include "customer.h"
#include "input.h"
#include "input.h"
#include "renderer.h"
#include "manager.h"
#include "debugProc.h"
#include "camera.h"
#include "bullet.h"
#include "scene3D.h"
#include "meshField.h"
#include "shadow.h"
#include "loadModel.h"

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 *CCustomer::m_pTexture = NULL;				// テクスチャ

//=============================================================================
// プレイヤークラスのコンストラクタ
//=============================================================================
CCustomer::CCustomer() : CSceneX(DOHYO_PRIORITY)
{
	// 値をクリア
	m_pVtxBuff = NULL;						// 頂点バッファへのポインタ
}

//=============================================================================
// デストラクタ
//=============================================================================
CCustomer::~CCustomer()
{

}

//=============================================================================
// オブジェクトの生成処理
//=============================================================================
CCustomer *CCustomer::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, int nType)
{
	CCustomer *pCustomer = NULL;

	if (pCustomer == NULL)
	{
		// オブジェクトクラスの生成
		pCustomer = new CCustomer;

		if (pCustomer != NULL)
		{
			pCustomer->BindModel(CLoadModel::GetBuffMat(nType), CLoadModel::GetNumMat(nType), CLoadModel::GetMesh(nType));
			//pCustomer->BindMat(m_pTexture);
			pCustomer->Init(pos, rot);
		}
	}

	return pCustomer;
}

//=============================================================================
// プレイヤー初期化処理
//=============================================================================
HRESULT CCustomer::Init(D3DXVECTOR3 pos, D3DXVECTOR3 rot)
{
	// オブジェクト初期化処理
	CSceneX::Init(pos);

	//オブジェクトの向き
	CSceneX::SetRot(rot);

	// オブジェクトの種類の設定
	SetObjType(CScene::OBJTYPE_DOHYO);

	return S_OK;
}

//=============================================================================
// プレイヤー終了処理
//=============================================================================
void CCustomer::Uninit(void)
{
	// 2Dオブジェクト終了処理
	CSceneX::Uninit();
}

//=============================================================================
// プレイヤー更新処理
//=============================================================================
void CCustomer::Update(void)
{

}

//=============================================================================
// プレイヤー描画処理
//=============================================================================
void CCustomer::Draw(void)
{
	// 2Dオブジェクト描画処理
	CSceneX::Draw();
}